const AU = [
  "นักเรียน / มหาลัย",
  "มาเฟีย",
  "แวมไพร์ x มนุษย์",
  "เทพเจ้า x มนุษย์",
  "Idol x Producer",
  "Idol x Fanclub",
  "Enemy to Lover",
  "อยู่คนละฝั่งสงคราม",
  "Roommate",
  "Canon divergent",
  "Modern AU",
  "Streamer x Viewer",
  "Single Parent",
  "เพื่อนบ้าน",
  "ยุคกลาง",
  "Fantasy",
  "Sci-Fi",
  "Dungeon",
  "ต่างโลก",
  "ผี x มนุษย์",
  "สถาปนิก x ชินแซ",
  "พ่อมด/แม่มด",
  "อัจฉริยะ",
  "นักวิจัย x นักวิทยาศาตร์",
  "นักกีฬา",
  "ประธานบริษัท",
  "นักข่าว",
  "นักการเมือง",
  "นักแข่งรถ",
  "คนดัง",
  "หมอ",
  "เจ้าหนี้ x ลูกหนี้",
  "จอมยุทธ์"
];

const roles = [
  "ฝ่าย A รู้สึกก่อน",
  "ฝ่าย B รู้สึกก่อน",
  "ต่างฝ่ายต่างไม่รู้ตัว",
  "รักกันแต่ไม่ยอมพูด",
  "คนหนึ่งปิดบังตัวตน",
  "แอบชอบ",
  "คนหนึ่งแกล้งไม่สนใจ",
  "รักที่เป็นไปไม่ได้",
  "เป็นชู้",
  "Toxic Relationship",
  "Healthy Relationship"
];

const meeting = [
  "ชนกันโดยบังเอิญ",
  "ช่วยชีวิตกันไว้",
  "เข้าใจผิดอย่างรุนแรง",
  "ถูกบังคับให้ร่วมงาน",
  "เป็นศัตรูกันตั้งแต่แรก",
  "เจอกันในวันที่แย่ที่สุด",
  "เจอกันโดยบังเอิญ",
  "รู้จักกันทางออนไลน์",
  "ประสบอุบัติเหตุ",
  "ฝ่ายใดฝ่ายหนึ่งพึ่งอกหักมา",
  "ทักผิดคน",
  "คลุมถุงชน"
];

const conflict = [
  "ความลับที่ห้ามบอก",
  "หน้าที่ขัดกับหัวใจ",
  "อายุขัยไม่เท่ากัน",
  "ถ้ารักกัน โลกจะพัง",
  "อีกฝ่ายต้องหายไป",
  "ความทรงจำที่ถูกลบ",
  "Friend zone",
  "แฟนเก่า",
  "ครอบครัว",
  "ลูกเลี้ยง",
  "ลูกนอกสมรส",
  "ล้มละลาย",
  "Long Distance Relationship",
  "กำแพงภาษา",
  "ความเห็นไม่ตรงกัน",
  "Slow Burn",
  "ฐานะต่างกัน",
  "มีตัวอิจฉา",
  "รักสามเส้า",
  "โพชนกัน",
  "การแข่งขัน",
  "หักหลังกัน"
];

const tone = [
  "หวานละมุน",
  "เจ็บช้าๆ",
  "ดราม่าหนัก",
  "Happy Ending แบบแลกมาด้วยน้ำตา",
  "Bad Ending",
  "Romanctic Comedy"
];

function rand(arr) {
  return arr[Math.floor(Math.random() * arr.length)];
}

function generateAU() {
  const result = document.getElementById("result");
  result.innerHTML =
`🪐 <span class="label">AU:</span> ${rand(AU)}
💫 <span class="label">บทบาท:</span> ${rand(roles)}
📍 <span class="label">First Meeting:</span> ${rand(meeting)}
🕯 <span class="label">ปมหลัก:</span> ${rand(conflict)}
🎭 <span class="label">โทนเรื่อง:</span> ${rand(tone)}`;
}

document
  .getElementById("generateBtn")
  .addEventListener("click", generateAU);
